In [1]:
# import libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# read dataset
mydata=pd.read_csv("Salary_Data_Based_country_and_race.csv")

In [3]:
mydata

,Unique Number,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race
0,0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0,UK,White
1,1,28.0,Female,Master's,Data Analyst,3.0,65000.0,USA,Hispanic
2,2,45.0,Male,PhD,Senior Manager,15.0,150000.0,Canada,White
3,3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0,USA,Hispanic
4,4,52.0,Male,Master's,Director,20.0,200000.0,USA,Asian
...,...,...,...,...,...,...,...,...,...
6699,6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0,UK,Mixed
6700,6700,32.0,Male,High School,Sales Associate,3.0,50000.0,Australia,Australian
6701,6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0,China,Chinese
6702,6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0,China,Korean
6703,6703,26.0,Female,High School,Sales Executive,1.0,35000.0,Canada,Black

In [4]:
mydata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unique Number        6704 non-null   int64
 1   Age                  6702 non-null   float64
 2   Gender               6702 non-null   object
 3   Education Level      6701 non-null   object
 4   Job Title            6702 non-null   object
 5   Years of Experience  6701 non-null   float64
 6   Salary               6699 non-null   float64
 7   Country              6704 non-null   object
 8   Race                 6704 non-null   object
dtypes: float64(3), int64(1), object(5)
memory usage: 471.5+ KB

In [5]:
mydata.describe()

       Unique Number          Age  Years of Experience         Salary
count    6704.000000  6702.000000          6701.000000    6699.000000
mean     3351.500000    33.620859             8.094687  115326.964771
std      1935.422435     7.614633             6.059003   52786.183911
min         0.000000    21.000000             0.000000     350.000000
25%      1675.750000    28.000000             3.000000   70000.000000
50%      3351.500000    32.000000             7.000000  115000.000000
75%      5027.250000    38.000000            12.000000  160000.000000
max      6703.000000    62.000000            34.000000  250000.000000

# Check for the missing values

In [6]:
mydata.isna().sum()

Unique Number          0
Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
Country                0
Race                   0
dtype: int64

# Drop the null values

In [7]:
mydata.dropna(inplace=True)

In [8]:
mydata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6698 entries, 0 to 6703
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unique Number        6698 non-null   int64
 1   Age                  6698 non-null   float64
 2   Gender               6698 non-null   object
 3   Education Level      6698 non-null   object
 4   Job Title            6698 non-null   object
 5   Years of Experience  6698 non-null   float64
 6   Salary               6698 non-null   float64
 7   Country              6698 non-null   object
 8   Race                 6698 non-null   object
dtypes: float64(3), int64(1), object(5)
memory usage: 523.3+ KB

# Check for the categories

In [9]:
mydata["Gender"].value_counts(dropna=False)

Male      3671
Female    3013
Other       14
Name: Gender, dtype: int64

In [10]:
mydata["Education Level"].value_counts(dropna=False)

Bachelor's Degree    2265
Master's Degree      1572
PhD                  1368
Bachelor's            756
High School           448
Master's              288
phD                     1
Name: Education Level, dtype: int64

In [11]:
mydata["Job Title"].value_counts(dropna=False)

Software Engineer             518
Data Scientist                453
Software Engineer Manager     376
Data Analyst                  363
Senior Project Engineer       318
                             ...
Account Manager                 1
Help Desk Analyst               1
Senior Training Specialist      1
Junior Web Designer             1
Software Project Manager        1
Name: Job Title, Length: 191, dtype: int64

In [12]:
mydata["Country"].value_counts(dropna=False)

USA          1359
China        1343
Australia    1336
UK           1335
Canada       1325
Name: Country, dtype: int64

In [13]:
mydata["Race"].value_counts(dropna=False)

White               1962
Asian               1603
Korean               457
Australian           452
Chinese              444
Black                437
African American     354
Mixed                334
Welsh                333
Hispanic             322
Name: Race, dtype: int64

In [14]:
#Education Level has repeatative degree (Eg. Bachelor's Degree and Bachelor's). Here, I merged same named degree categories.

mydata["Education Level"].replace("Bachelor's Degree","Bachelor", inplace=True)
mydata["Education Level"].replace("Bachelor's","Bachelor", inplace=True)
mydata["Education Level"].replace("Master's Degree","Master", inplace=True)
mydata["Education Level"].replace("Master's","Master",inplace=True)
mydata["Education Level"].replace("PhD","PhD", inplace=True)
mydata["Education Level"].replace("phD","PhD", inplace=True)

In [15]:
mydata["Education Level"].value_counts(dropna=False)

Bachelor       3021
Master         1860
PhD            1369
High School     448
Name: Education Level, dtype: int64

In [18]:
mydata.to_excel(r'D:\Simpli Learn- Data Analytics Bootcamp\Final Project\Cleaned Salary dataset.xlsx', index=False)